tutorials/fluidSolidInteraction/cavityFlexibleBottom/constant/fluid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
 (0 0 0)//0
 (1.75 0 0)//1
 (2 -.1767766953 0)//2
 (2 -.25 0) //3
 (2 -1 0)//4
 (2.25 -1 0)//5
 (5.75 -1 0)//6

 (6 -1 0)//7
 (6 -.25 0)//8
 (6 -.1767766953 0)//9
 (6.25 0 0)//10
 (14 0 0)//11
 (14 .25 0)//12
 (14 1 0)//13

 (6.25 1 0)//14
 (5.75 1 0)//15
 (2.25 1 0)//16
 (1.75 1 0)//17
 (0 1 0)//18
 (0 .25 0)//19
 (1.75 .25 0)//20

 (2.1035533902966368811002110905262 0 0)//21
 (2.25 -.25 0)//22
 (5.75 -.25 0)//23
 (5.8964466097033631188997889094738 0 0)//24
 (6.25 .25 0)//25

 //Next set +z=1
 (0 0 1)//26
 (1.75 0 1)//27
 (2 -.1767766953 1)//28
 (2 -.25 1)//29
 (2 -1 1)//30
 (2.25 -1 1)//31
 (5.75 -1 1)//32

 (6 -1 1)//33
 (6 -.25 1)//34
 (6 -.1767766953 1)///35
 (6.25 0 1)//36
 (14 0 1)//37
 (14 .25 1)//38
 (14 1 1)//39

 (6.25 1 1)//40
 (5.75 1 1)//41
 (2.25 1 1)//42
 (1.75 1 1)//43
 (0 1 1)//44
 (0 .25 1)//45
 (1.75 .25 1)//46

 (2.1035533902966368811002110905262 0 1)//47
 (2.25 -.25 1)//48
 (5.75 -.25 1)//49
 (5.8964466097033631188997889094738 0 1)//50
 (6.25 .25 1)//51
);

//Finest mesh
/*
blocks
(
    hex (0 1 20 19 26 27 46 45) (144 16 1) simpleGrading (1 1 1) //block 0
    hex (1 2 21 20 27 28 47 46) (24 16 1) simpleGrading (1 1 1) //block 1
    hex (2 3 22 21 28 29 48 47) (16 16 1) simpleGrading (1 1 1) //block 2
    hex (4 5 22 3 30 31 48 29) (16 64 1) simpleGrading (1 1 1) //block 3
    hex (5 6 23 22 31 32 49 48) (280 64 1) simpleGrading (1 1 1) //block 4
    hex (6 7 8 23 32 33 34 49) (16 64 1) simpleGrading (1 1 1) //block 5
    hex (8 9 24 23 34 35 50 49) (16 16 1) simpleGrading (1 1 1) //block 6
    hex (9 10 25 24 35 36 51 50) (24 16 1) simpleGrading (1 1 1) //block 7
    hex (10 11 12 25 36 37 38 51) (624 16 1) simpleGrading (1 1 1) //block 8
    hex (25 12 13 14 51 38 39 40) (624 64 1) simpleGrading (1 1 1) //block 9
    hex (24 25 14 15 50 51 40 41) (24 64 1) simpleGrading (1 1 1) //block 10
    hex (21 24 15 16 47 50 41 42) (280 64 1) simpleGrading (1 1 1) //block 11
    hex (22 23 24 21 48 49 50 47) (280 16 1) simpleGrading (1 1 1) //block 12
    hex (20 21 16 17 46 47 42 43) (24 64 1) simpleGrading (1 1 1) //block 13
    hex (17 18 19 20 43 44 45 46) (144 64  1) simpleGrading (1 1 1) //block 14
);
*/

//Medium mesh
/*
blocks
(
    hex (0 1 20 19 26 27 46 45) (36 4 1) simpleGrading (1 1 1) //block 0
    hex (1 2 21 20 27 28 47 46) (6 4 1) simpleGrading (1 1 1) //block 1
    hex (2 3 22 21 28 29 48 47) (4 4 1) simpleGrading (1 1 1) //block 2
    hex (4 5 22 3 30 31 48 29) (4 16 1) simpleGrading (1 1 1) //block 3
    hex (5 6 23 22 31 32 49 48) (70 16 1) simpleGrading (1 1 1) //block 4
    hex (6 7 8 23 32 33 34 49) (4 16 1) simpleGrading (1 1 1) //block 5
    hex (8 9 24 23 34 35 50 49) (4 4 1) simpleGrading (1 1 1) //block 6
    hex (9 10 25 24 35 36 51 50) (6 4 1) simpleGrading (1 1 1) //block 7
    hex (10 11 12 25 36 37 38 51) (156 4 1) simpleGrading (1 1 1) //block 8
    hex (25 12 13 14 51 38 39 40) (156 16 1) simpleGrading (1 1 1) //block 9
    hex (24 25 14 15 50 51 40 41) (6 16 1) simpleGrading (1 1 1) //block 10
    hex (21 24 15 16 47 50 41 42) (70 16 1) simpleGrading (1 1 1) //block 11
    hex (22 23 24 21 48 49 50 47) (70 4 1) simpleGrading (1 1 1) //block 12
    hex (20 21 16 17 46 47 42 43) (6 16 1) simpleGrading (1 1 1) //block 13
    hex (17 18 19 20 43 44 45 46) (36 16  1) simpleGrading (1 1 1) //block 14
);
*/



//Coarse Mesh
blocks
(
    hex (0 1 20 19 26 27 46 45) (18 2 1) simpleGrading (1 1 1) //block 0
    hex (1 2 21 20 27 28 47 46) (3 2 1) simpleGrading (1 1 1) //block 1
    hex (2 3 22 21 28 29 48 47) (2 2 1) simpleGrading (1 1 1) //block 2
    hex (4 5 22 3 30 31 48 29) (2 8 1) simpleGrading (1 1 1) //block 3
    hex (5 6 23 22 31 32 49 48) (35 8 1) simpleGrading (1 1 1) //block 4
    hex (6 7 8 23 32 33 34 49) (2 8 1) simpleGrading (1 1 1) //block 5
    hex (8 9 24 23 34 35 50 49) (2 2 1) simpleGrading (1 1 1) //block 6
    hex (9 10 25 24 35 36 51 50) (3 2 1) simpleGrading (1 1 1) //block 7
    hex (10 11 12 25 36 37 38 51) (78 2 1) simpleGrading (1 1 1) //block 8
    hex (25 12 13 14 51 38 39 40) (78 8 1) simpleGrading (1 1 1) //block 9
    hex (24 25 14 15 50 51 40 41) (3 8 1) simpleGrading (1 1 1) //block 10
    hex (21 24 15 16 47 50 41 42) (35 8 1) simpleGrading (1 1 1) //block 11
    hex (22 23 24 21 48 49 50 47) (35 2 1) simpleGrading (1 1 1) //block 12
    hex (20 21 16 17 46 47 42 43) (3 8 1) simpleGrading (1 1 1) //block 13
    hex (17 18 19 20 43 44 45 46) (18 8  1) simpleGrading (1 1 1) //block 14
);


edges
(
    arc 1 2 (1.845670858 -0.01903011687 0)
    arc 27 28 (1.845670858 -0.01903011687 1)
    arc 20 21 (1.9267766952966368811002110905262 0.2 0 )
    arc 46 47 (1.9267766952966368811002110905262 0.2 1 )
    arc 9 10 (6.154329142 -0.01903011687 0)
    arc 35 36 (6.154329142 -0.01903011687 1)
    arc 24 25 (6.0732233047033631188997889094738  0.2 0 )
    arc 50 51 (6.0732233047033631188997889094738  0.2 1 )
    arc 21 22 (2.155 -0.07322330470336311889978890947379 0 )
    arc 47 48 (2.155 -0.07322330470336311889978890947379 1 )
    arc 23 24 (5.845 -0.07322330470336311889978890947379 0 )
    arc 49 50 (5.845 -0.07322330470336311889978890947379 1 )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 19 45 26)
            (19 18 44 45)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (11 12 38 37)
            (12 13 39 38)
        );
    }

    walls
    {
        type walls;
        faces
        (
            (0 1 27 26)
            (1 2 28 27)
            (2 3 29 28)
            (3 4 30 29)
            (7 8 34 33)
            (8 9 35 34)
            (9 10 36 35)
            (10 11 37 36)
            (13 14 40 39)
            (14 15 40 41)
            (15 16 42 41)
            (16 17 43 42)
            (17 18 44 43)
        );
    }

    interface
    {

        type walls;
        faces
        (
            (4 5 31 30)
            (5 6 32 31)
            (6 7 33 32)
        );


    }
 );


mergePatchPairs
(
);


// ************************************************************************* //
