tutorials/fluidSolidInteraction/cavityFlexibleBottom/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------* \
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         polynomial
        (
            ((1.5 0 0)  (0 0 0))  // Coefficient for y^0 = 1
            ((-6 0 0) (2 0 0))    // Coefficient for y^2 = -6
        );
        direction       (0 1 0);
        origin          0.5;
    }

    walls
    {
        // Can be used in openfoam but not available in foam extend
        //type            noSlip;

        // Can be used in all versions
        type              fixedValue;
        value             uniform (0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    interface
    {
        type            newMovingWallVelocity;
        value           uniform (0 0 0);
    }

    defaultFaces
    {
        type            empty;
    }
}
